<template>
    <section class="animate-contentFade-in max-w-2xl mx-auto px-3 md:px-0">
        <button @click="goBack()" class="w-full flex justify-start p-5 mb-10">
            <svg width="53" height="52" viewBox="0 0 53 52" fill="none" xmlns="http://www.w3.org/2000/svg">
<g filter="url(#filter0_d_1415_5071)">
<rect width="45" height="45" rx="11.2009" transform="matrix(-1 0 0 1 48 0)" fill="white"/>
<rect x="-0.580357" y="0.580357" width="43.8393" height="43.8393" rx="10.6205" transform="matrix(-1 0 0 1 46.8393 0)" stroke="url(#paint0_linear_1415_5071)" stroke-width="1.16071"/>
<path d="M33.1563 21.7072C33.1563 20.8562 32.4505 20.1504 31.5994 20.1504L19.1447 20.1504C18.2937 20.1504 17.5879 20.8562 17.5879 21.7072C17.5879 22.5583 18.2937 23.2641 19.1447 23.2641L31.5994 23.2641C32.4505 23.2641 33.1563 22.5583 33.1563 21.7072Z" fill="url(#paint1_linear_1415_5071)"/>
<path d="M35.2323 21.7067C35.2323 21.3123 35.087 20.9179 34.7756 20.6066L28.5483 14.3792C27.9463 13.7772 26.9499 13.7772 26.348 14.3792C25.746 14.9812 25.746 15.9776 26.348 16.5795L31.4751 21.7067L26.348 26.8339C25.746 27.4359 25.746 28.4323 26.348 29.0342C26.9499 29.6362 27.9463 29.6362 28.5483 29.0342L34.7756 22.8069C35.087 22.4955 35.2323 22.1011 35.2323 21.7067Z" fill="url(#paint2_linear_1415_5071)"/>
</g>
<defs>
<filter id="filter0_d_1415_5071" x="0.678571" y="0" width="51.9643" height="51.9643" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
<feFlood flood-opacity="0" result="BackgroundImageFix"/>
<feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
<feMorphology radius="2.32143" operator="erode" in="SourceAlpha" result="effect1_dropShadow_1415_5071"/>
<feOffset dx="1.16071" dy="3.48214"/>
<feGaussianBlur stdDeviation="2.90179"/>
<feComposite in2="hardAlpha" operator="out"/>
<feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"/>
<feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_1415_5071"/>
<feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_1415_5071" result="shape"/>
</filter>
<linearGradient id="paint0_linear_1415_5071" x1="45" y1="3.69399" x2="-1.29191" y2="5.42561" gradientUnits="userSpaceOnUse">
<stop stop-color="#FF4F62"/>
<stop offset="0.5" stop-color="#FFAAA9"/>
<stop offset="1" stop-color="#FF4F62"/>
</linearGradient>
<linearGradient id="paint1_linear_1415_5071" x1="13.8515" y1="21.7072" x2="37.5154" y2="21.7072" gradientUnits="userSpaceOnUse">
<stop offset="0.239583" stop-color="#E72F5E"/>
<stop offset="0.84375" stop-color="#BC2A4F"/>
</linearGradient>
<linearGradient id="paint2_linear_1415_5071" x1="23.6559" y1="21.7067" x2="37.8464" y2="21.7067" gradientUnits="userSpaceOnUse">
<stop offset="0.239583" stop-color="#E72F5E"/>
<stop offset="0.84375" stop-color="#BC2A4F"/>
</linearGradient>
</defs>
</svg>

        </button>

        <div class="flex justify-center items-center mb-12">
            <shelifeIcon/>
        </div>
        <div class="px-5 max-w-3xl mx-auto">
            <h2 class="font-bold text-base text-right my-2">
                اصطلاحاتی که در این شرایط و قوانین به کار رفته است دارای معانی مشروح زیر است:
            </h2>
            <p class="text-sm text-right leading-6">

۱-۱- شرکت: شرکت ایده گزین ارتباطات روماک که نسبت به ارائه خدمات اسنپ اقدام می‌کند.
۱-۲- اسنپ: خدمات نرم‌افزاری که توسط شرکت به منظور جابه‌جایی مسافر به کاربران ارائه می‌شود.
۱-۳- سوپر اپ اسنپ: خدمات نرم‌افزاری که توسط شرکت و با همکاری طرف تجاری و روی نرم‌افزار اسنپ به کاربران ارائه می‌شود.
۱-۴- اپلیکیشن: نرم‌افزار متعلق به شرکت که به منظور استفاده از خدمات اسنپ یا سوپر اپ اسنپ، حق استفادۀ موقت از آن برابر شرایط مندرج در قرارداد خصوصی و سند حاضر به کاربران یا طرف‌های تجاری شرکت اعطا می‌شود.
۱-۵- قرارداد خصوصی: توافق کتبی یا الکترونیکی فی‌مابین شرکت و کاربر راننده یا طرف‌های تجاری شرکت، جهت بهره‌برداری موقت از نرم‌افزار اسنپ.
۱-۶- کاربر: شخصی حقیقی یا حقوقی است اعم از مسافر، راننده و مهمان که برابر شرایط و قوانین حاضر از طریق اینترنت به اپلیکیشن متصل و از خدمات اسنپ یا سوپر اپ اسنپ بهره مند میشود.
۱-۷- کاربران: از کاربر راننده، کاربر مسافر و کاربر مهمان یا سایر کاربران سوپر اپ اسنپ، تحت عنوان کاربران یاد می‌شود.
۱-۸- کاربر راننده: شخص حقیقی است که در اپلیکیشن راننده اسنپ برای دریافت درخواست سفر و ارائۀ خدمات ثبت‌‌نام کرده ‌است.
۱-۹- کاربر مسافر: شخص حقیقی یا حقوقی است که در اپلیکیشن مسافر اسنپ برای ارسال درخواست سفر ثبت‌‌نام کرده‌ است.
۱-۱۰- کاربر مهمان: شخص حقیقی است که بدون نیاز به داشتن حساب کاربری، توسط کاربر مسافر جهت استفاده از خدمات اسنپ معرفی می شود.
۱-۱۱- طرف تجاری: اشخاص حقیقی و حقوقی که برابر قرارداد خصوصی از طریق ایجاد درگاه، حق بهره‌برداری موقت از اپلیکیشن را با نام تجاری خود یا مشترک با اسنپ دارند.
۱-۱۲- حساب کاربری: حسابی است که اشخاص برای استفاده از خدمات اسنپ یا سوپر اپ اسنپ در اپلیکیشن ایجاد کرده‌اند.
۱-۱۳- کد تخفیف: کد صادر و تامین اعتبار شده توسط اسنپ که برابر آن کاربر مسافر می تواند با وارد کردن در اپلیکیشن از پرداخت کل یا قسمتی از هزینه سفر معاف می شود. 
۱-۱۴- کد تخفیف سازمانی: کد صادر شده توسط اسنپ و تامین اعتبار شده توسط مدیر پنل سازمانی اسنپ که برابر آن کاربر مسافر می تواند با وارد کردن در اپلیکیشن از پرداخت کل یا قسمتی از هزینه سفر معاف می شود.
۱-۱۵- مدیر پنل سازمانی: شخص حقیقی یا حقوقی که حق استفاده از پنل سازمانی اسنپ، جهت انجام سفر را دارد.
۱-۱۶- موجودی: مبلغی است که کاربران در حساب کاربری خود به منظور استفاده از خدمات اسنپ یا سوپر اپ اسنپ دارند. این مبلغ به صورت پرداخت از طریق سامانۀ بانکی و کارتهای عضو شبکۀ شتاب و یا با استفاده از اسنپ کارت یا کیف پول طرف های تجاری طبق شرایط و قوانین حاضر منظور و محاسبه خواهد شد.
۱-۱۷- اطلاعات محرمانه: اطلاعاتی که توسط کاربران در اسنپ یا سوپر اپ اسنپ قرار داده می‌شود، اعم از اطلاعاتی که به صورت مستقیم از سوی کاربران وارد می‌شود و همچنین اطلاعاتی که به صورت خودکار و در نتیجۀ بهره‌برداری از خدمات اسنپ یا سوپر اپ اسنپ توسط شرکت یا طرف‌های تجاری تولید یا در اختیار شرکت قرار داده می‌شود.
۱-۱۸- قوانین و مقررات جمهوری اسلامی ایران: قانون اساسی، قوانین عادی، آئین‌نامه‌های اجرایی، بخشنامه‌ها، دستورالعمل‌ها و کلیه ضوابط قانونی حاکم بر انجام موضوع قرارداد اعم از قانون بیمه اجباری شخص ثالث، آئین نامه راهنمائی و رانندگی و قانون رسیدگی به تخلفات رانندگی.
            </p>
        </div>  
    </section>
</template>

<script setup>
import shelifeIcon from '../components/shelifeIcon.vue';
import {useRouter} from 'vue-router';
const router = useRouter();
const goBack = ()=>{
    router.go(-1);
};
</script>