<template>
    <section class="flex justify-center animate-contentFade-in max-w-6xl mx-auto px-3 mb-4 md:px-0">
        <div class="h-auto w-60 hidden md:block">
            <img class="h-full" src="../assets/image/starsImage.png" alt="starspng">
        </div>
        <section>
            <button @click="goBack()" class="w-full flex justify-start p-5 mb-10">
                <goBackIconVue/>
            </button>

            <div class="flex justify-center items-center mb-12">
                <shelifeIcon/>
            </div>
            <div class="px-5 max-w-3xl mx-auto">
                <h2 class="font-bold text-base text-right my-2">
                    اصطلاحاتی که در این شرایط و قوانین به کار رفته است دارای معانی مشروح زیر است:
                </h2>
            
                <div class="flex flex-col gap-2 text-sm text-right leading-6">
                <p>۱-۱- شرکت: شرکت ایده گزین ارتباطات روماک که نسبت به ارائه خدمات اسنپ اقدام می‌کند.</p>
                <p>۱-۲- اسنپ: خدمات نرم‌افزاری که توسط شرکت به منظور جابه‌جایی مسافر به کاربران ارائه می‌شود.</p>

                <p>۱-۳- سوپر اپ اسنپ: خدمات نرم‌افزاری که توسط شرکت و با همکاری طرف تجاری و روی نرم‌افزار اسنپ به کاربران ارائه می‌شود.</p>

                <P>۱-۴- اپلیکیشن: نرم‌افزار متعلق به شرکت که به منظور استفاده از خدمات اسنپ یا سوپر اپ اسنپ، حق استفادۀ موقت از آن برابر شرایط مندرج در قرارداد خصوصی و سند حاضر به کاربران یا طرف‌های تجاری شرکت اعطا می‌شود.</P>

                <P>۱-۵- قرارداد خصوصی: توافق کتبی یا الکترونیکی فی‌مابین شرکت و کاربر راننده یا طرف‌های تجاری شرکت، جهت بهره‌برداری موقت از نرم‌افزار اسنپ.
                </P>

                <P>۱-۶- کاربر: شخصی حقیقی یا حقوقی است اعم از مسافر، راننده و مهمان که برابر شرایط و قوانین حاضر از طریق اینترنت به اپلیکیشن متصل و از خدمات اسنپ یا سوپر اپ اسنپ بهره مند میشود.
                </P>

                <p>
                    ۱-۷- کاربران: از کاربر راننده، کاربر مسافر و کاربر مهمان یا سایر کاربران سوپر اپ اسنپ، تحت عنوان کاربران یاد می‌شود.
                </p>

                <p>
                    ۱-۸- کاربر راننده: شخص حقیقی است که در اپلیکیشن راننده اسنپ برای دریافت درخواست سفر و ارائۀ خدمات ثبت‌‌نام کرده ‌است.
                </p>

                <p>
                    ۱-۹- کاربر مسافر: شخص حقیقی یا حقوقی است که در اپلیکیشن مسافر اسنپ برای ارسال درخواست سفر ثبت‌‌نام کرده‌ است.
                </p>

                <p>
                    ۱-۱۰- کاربر مهمان: شخص حقیقی است که بدون نیاز به داشتن حساب کاربری، توسط کاربر مسافر جهت استفاده از خدمات اسنپ معرفی می شود.
                </p>

                <p>
                    ۱-۱۱- طرف تجاری: اشخاص حقیقی و حقوقی که برابر قرارداد خصوصی از طریق ایجاد درگاه، حق بهره‌برداری موقت از اپلیکیشن را با نام تجاری خود یا مشترک با اسنپ دارند.
                </p>

                <p>
                    ۱-۱۲- حساب کاربری: حسابی است که اشخاص برای استفاده از خدمات اسنپ یا سوپر اپ اسنپ در اپلیکیشن ایجاد کرده‌اند.
                </p>

                <p>
                    ۱-۱۳- کد تخفیف: کد صادر و تامین اعتبار شده توسط اسنپ که برابر آن کاربر مسافر می تواند با وارد کردن در اپلیکیشن از پرداخت کل یا قسمتی از هزینه سفر معاف می شود. 
                </p>

                <p>
                    ۱-۱۴- کد تخفیف سازمانی: کد صادر شده توسط اسنپ و تامین اعتبار شده توسط مدیر پنل سازمانی اسنپ که برابر آن کاربر مسافر می تواند با وارد کردن در اپلیکیشن از پرداخت کل یا قسمتی از هزینه سفر معاف می شود.
                </p>

                <p>
                    ۱-۱۵- مدیر پنل سازمانی: شخص حقیقی یا حقوقی که حق استفاده از پنل سازمانی اسنپ، جهت انجام سفر را دارد.
                </p>

                <p>
                    ۱-۱۶- موجودی: مبلغی است که کاربران در حساب کاربری خود به منظور استفاده از خدمات اسنپ یا سوپر اپ اسنپ دارند. این مبلغ به صورت پرداخت از طریق سامانۀ بانکی و کارتهای عضو شبکۀ شتاب و یا با استفاده از اسنپ کارت یا کیف پول طرف های تجاری طبق شرایط و قوانین حاضر منظور و محاسبه خواهد شد.
                </p>

                <p>
                    ۱-۱۷- اطلاعات محرمانه: اطلاعاتی که توسط کاربران در اسنپ یا سوپر اپ اسنپ قرار داده می‌شود، اعم از اطلاعاتی که به صورت مستقیم از سوی کاربران وارد می‌شود و همچنین اطلاعاتی که به صورت خودکار و در نتیجۀ بهره‌برداری از خدمات اسنپ یا سوپر اپ اسنپ توسط شرکت یا طرف‌های تجاری تولید یا در اختیار شرکت قرار داده می‌شود.
                </p>
                <p>
                    ۱-۱۸- قوانین و مقررات جمهوری اسلامی ایران: قانون اساسی، قوانین عادی، آئین‌نامه‌های اجرایی، بخشنامه‌ها، دستورالعمل‌ها و کلیه ضوابط قانونی حاکم بر انجام موضوع قرارداد اعم از قانون بیمه اجباری شخص ثالث، آئین نامه راهنمائی و رانندگی و قانون رسیدگی به تخلفات رانندگی.
                </p>
                </div>
            </div>  
        </section>
        <div class="h-auto w-60 hidden md:block">
            <img class="h-full w-full" src="../assets/image/starsImage.png" alt="starspng">
        </div>
    </section>
</template>

<script setup>
import shelifeIcon from '../components/shelifeIcon.vue';
import {useRouter} from 'vue-router';
import goBackIconVue from '../components/Icons/goBackIcon.vue';
const router = useRouter();
const goBack = ()=>{
    router.go(-1);
};
</script>